; domain
(define (domain transport-strips)
(:requirements :typing :action-costs)

(:types location fuellevel locatable - object 
	package truck - locatable
)

(:predicates 
(connected ?l1 ?l2 - location)
(at ?o - locatable ?l - location)
(in ?p - package ?t - truck)
(fuel ?t - truck ?level - fuellevel)
(fuelcost ?level - fuellevel ?l1 ?l2 - location)
(sum ?a ?b ?c - fuellevel)
)

(:functions 
(total-cost) - number)

(:action LOAD
:parameters
(?p - package
?t - truck
?l - location)
:precondition
(and (at ?t ?l) (at ?p ?l))
:effect
(and (not (at ?p ?l)) (in ?p ?t) (increase (total-cost) 1))
)

(:action UNLOAD
:parameters
(?p - package
?t - truck
?l - location)
:precondition
(and (at ?t ?l) (in ?p ?t))
:effect
(and (at ?p ?l) (not (in ?p ?t)) (increase (total-cost) 1))
)

(:action DRIVE
:parameters
(?t - truck
?l1 - location
?l2 - location
?fuelpost - fuellevel
?fueldelta - fuellevel
?fuelpre - fuellevel)
:precondition
(and 
(connected ?l1 ?l2)
(fuelcost ?fueldelta ?l1 ?l2)
(fuel ?t ?fuelpre)
(sum ?fuelpost ?fueldelta ?fuelpre)
(at ?t ?l1)
)
:effect
(and (not (at ?t ?l1)) 
     (at ?t ?l2) 
     (not (fuel ?t ?fuelpre)) 
     (fuel ?t ?fuelpost)
     (increase (total-cost) 1))
)

)

; problem
(define (problem transport-l4-t1-p4---int100n150-m25---int100c200---s29---e0)
(:domain transport-strips)

(:objects
l0 l1 l2 l3 - location
t0 - truck
p0 p1 p2 p3 - package
level0 level1 level2 level3 level4 level5 level6 level7 level8 level9 level10 level11 level12 level13 level14 level15 level16 level17 level18 level19 level20 level21 level22 level23 level24 level25 level26 level27 level28 level29 level30 level31 level32 level33 level34 level35 level36 level37 level38 level39 level40 level41 level42 level43 level44 level45 level46 level47 level48 level49 level50 level51 level52 level53 level54 level55 level56 level57 level58 level59 level60 level61 level62 level63 level64 level65 level66 - fuellevel
)

(:init
(sum level0 level5 level5)
(sum level0 level6 level6)
(sum level0 level10 level10)
(sum level0 level15 level15)
(sum level0 level21 level21)
(sum level1 level5 level6)
(sum level1 level6 level7)
(sum level1 level10 level11)
(sum level1 level15 level16)
(sum level1 level21 level22)
(sum level2 level5 level7)
(sum level2 level6 level8)
(sum level2 level10 level12)
(sum level2 level15 level17)
(sum level2 level21 level23)
(sum level3 level5 level8)
(sum level3 level6 level9)
(sum level3 level10 level13)
(sum level3 level15 level18)
(sum level3 level21 level24)
(sum level4 level5 level9)
(sum level4 level6 level10)
(sum level4 level10 level14)
(sum level4 level15 level19)
(sum level4 level21 level25)
(sum level5 level5 level10)
(sum level5 level6 level11)
(sum level5 level10 level15)
(sum level5 level15 level20)
(sum level5 level21 level26)
(sum level6 level5 level11)
(sum level6 level6 level12)
(sum level6 level10 level16)
(sum level6 level15 level21)
(sum level6 level21 level27)
(sum level7 level5 level12)
(sum level7 level6 level13)
(sum level7 level10 level17)
(sum level7 level15 level22)
(sum level7 level21 level28)
(sum level8 level5 level13)
(sum level8 level6 level14)
(sum level8 level10 level18)
(sum level8 level15 level23)
(sum level8 level21 level29)
(sum level9 level5 level14)
(sum level9 level6 level15)
(sum level9 level10 level19)
(sum level9 level15 level24)
(sum level9 level21 level30)
(sum level10 level5 level15)
(sum level10 level6 level16)
(sum level10 level10 level20)
(sum level10 level15 level25)
(sum level10 level21 level31)
(sum level11 level5 level16)
(sum level11 level6 level17)
(sum level11 level10 level21)
(sum level11 level15 level26)
(sum level11 level21 level32)
(sum level12 level5 level17)
(sum level12 level6 level18)
(sum level12 level10 level22)
(sum level12 level15 level27)
(sum level12 level21 level33)
(sum level13 level5 level18)
(sum level13 level6 level19)
(sum level13 level10 level23)
(sum level13 level15 level28)
(sum level13 level21 level34)
(sum level14 level5 level19)
(sum level14 level6 level20)
(sum level14 level10 level24)
(sum level14 level15 level29)
(sum level14 level21 level35)
(sum level15 level5 level20)
(sum level15 level6 level21)
(sum level15 level10 level25)
(sum level15 level15 level30)
(sum level15 level21 level36)
(sum level16 level5 level21)
(sum level16 level6 level22)
(sum level16 level10 level26)
(sum level16 level15 level31)
(sum level16 level21 level37)
(sum level17 level5 level22)
(sum level17 level6 level23)
(sum level17 level10 level27)
(sum level17 level15 level32)
(sum level17 level21 level38)
(sum level18 level5 level23)
(sum level18 level6 level24)
(sum level18 level10 level28)
(sum level18 level15 level33)
(sum level18 level21 level39)
(sum level19 level5 level24)
(sum level19 level6 level25)
(sum level19 level10 level29)
(sum level19 level15 level34)
(sum level19 level21 level40)
(sum level20 level5 level25)
(sum level20 level6 level26)
(sum level20 level10 level30)
(sum level20 level15 level35)
(sum level20 level21 level41)
(sum level21 level5 level26)
(sum level21 level6 level27)
(sum level21 level10 level31)
(sum level21 level15 level36)
(sum level21 level21 level42)
(sum level22 level5 level27)
(sum level22 level6 level28)
(sum level22 level10 level32)
(sum level22 level15 level37)
(sum level22 level21 level43)
(sum level23 level5 level28)
(sum level23 level6 level29)
(sum level23 level10 level33)
(sum level23 level15 level38)
(sum level23 level21 level44)
(sum level24 level5 level29)
(sum level24 level6 level30)
(sum level24 level10 level34)
(sum level24 level15 level39)
(sum level24 level21 level45)
(sum level25 level5 level30)
(sum level25 level6 level31)
(sum level25 level10 level35)
(sum level25 level15 level40)
(sum level25 level21 level46)
(sum level26 level5 level31)
(sum level26 level6 level32)
(sum level26 level10 level36)
(sum level26 level15 level41)
(sum level26 level21 level47)
(sum level27 level5 level32)
(sum level27 level6 level33)
(sum level27 level10 level37)
(sum level27 level15 level42)
(sum level27 level21 level48)
(sum level28 level5 level33)
(sum level28 level6 level34)
(sum level28 level10 level38)
(sum level28 level15 level43)
(sum level28 level21 level49)
(sum level29 level5 level34)
(sum level29 level6 level35)
(sum level29 level10 level39)
(sum level29 level15 level44)
(sum level29 level21 level50)
(sum level30 level5 level35)
(sum level30 level6 level36)
(sum level30 level10 level40)
(sum level30 level15 level45)
(sum level30 level21 level51)
(sum level31 level5 level36)
(sum level31 level6 level37)
(sum level31 level10 level41)
(sum level31 level15 level46)
(sum level31 level21 level52)
(sum level32 level5 level37)
(sum level32 level6 level38)
(sum level32 level10 level42)
(sum level32 level15 level47)
(sum level32 level21 level53)
(sum level33 level5 level38)
(sum level33 level6 level39)
(sum level33 level10 level43)
(sum level33 level15 level48)
(sum level33 level21 level54)
(sum level34 level5 level39)
(sum level34 level6 level40)
(sum level34 level10 level44)
(sum level34 level15 level49)
(sum level34 level21 level55)
(sum level35 level5 level40)
(sum level35 level6 level41)
(sum level35 level10 level45)
(sum level35 level15 level50)
(sum level35 level21 level56)
(sum level36 level5 level41)
(sum level36 level6 level42)
(sum level36 level10 level46)
(sum level36 level15 level51)
(sum level36 level21 level57)
(sum level37 level5 level42)
(sum level37 level6 level43)
(sum level37 level10 level47)
(sum level37 level15 level52)
(sum level37 level21 level58)
(sum level38 level5 level43)
(sum level38 level6 level44)
(sum level38 level10 level48)
(sum level38 level15 level53)
(sum level38 level21 level59)
(sum level39 level5 level44)
(sum level39 level6 level45)
(sum level39 level10 level49)
(sum level39 level15 level54)
(sum level39 level21 level60)
(sum level40 level5 level45)
(sum level40 level6 level46)
(sum level40 level10 level50)
(sum level40 level15 level55)
(sum level40 level21 level61)
(sum level41 level5 level46)
(sum level41 level6 level47)
(sum level41 level10 level51)
(sum level41 level15 level56)
(sum level41 level21 level62)
(sum level42 level5 level47)
(sum level42 level6 level48)
(sum level42 level10 level52)
(sum level42 level15 level57)
(sum level42 level21 level63)
(sum level43 level5 level48)
(sum level43 level6 level49)
(sum level43 level10 level53)
(sum level43 level15 level58)
(sum level43 level21 level64)
(sum level44 level5 level49)
(sum level44 level6 level50)
(sum level44 level10 level54)
(sum level44 level15 level59)
(sum level44 level21 level65)
(sum level45 level5 level50)
(sum level45 level6 level51)
(sum level45 level10 level55)
(sum level45 level15 level60)
(sum level45 level21 level66)
(sum level46 level5 level51)
(sum level46 level6 level52)
(sum level46 level10 level56)
(sum level46 level15 level61)
(sum level47 level5 level52)
(sum level47 level6 level53)
(sum level47 level10 level57)
(sum level47 level15 level62)
(sum level48 level5 level53)
(sum level48 level6 level54)
(sum level48 level10 level58)
(sum level48 level15 level63)
(sum level49 level5 level54)
(sum level49 level6 level55)
(sum level49 level10 level59)
(sum level49 level15 level64)
(sum level50 level5 level55)
(sum level50 level6 level56)
(sum level50 level10 level60)
(sum level50 level15 level65)
(sum level51 level5 level56)
(sum level51 level6 level57)
(sum level51 level10 level61)
(sum level51 level15 level66)
(sum level52 level5 level57)
(sum level52 level6 level58)
(sum level52 level10 level62)
(sum level53 level5 level58)
(sum level53 level6 level59)
(sum level53 level10 level63)
(sum level54 level5 level59)
(sum level54 level6 level60)
(sum level54 level10 level64)
(sum level55 level5 level60)
(sum level55 level6 level61)
(sum level55 level10 level65)
(sum level56 level5 level61)
(sum level56 level6 level62)
(sum level56 level10 level66)
(sum level57 level5 level62)
(sum level57 level6 level63)
(sum level58 level5 level63)
(sum level58 level6 level64)
(sum level59 level5 level64)
(sum level59 level6 level65)
(sum level60 level5 level65)
(sum level60 level6 level66)
(sum level61 level5 level66)

(connected l0 l1)
(fuelcost level15 l0 l1)
(connected l0 l2)
(fuelcost level6 l0 l2)
(connected l0 l3)
(fuelcost level21 l0 l3)
(connected l1 l0)
(fuelcost level15 l1 l0)
(connected l1 l2)
(fuelcost level10 l1 l2)
(connected l1 l3)
(fuelcost level6 l1 l3)
(connected l2 l0)
(fuelcost level6 l2 l0)
(connected l2 l1)
(fuelcost level10 l2 l1)
(connected l2 l3)
(fuelcost level5 l2 l3)
(connected l3 l0)
(fuelcost level21 l3 l0)
(connected l3 l1)
(fuelcost level6 l3 l1)
(connected l3 l2)
(fuelcost level5 l3 l2)

(at t0 l0)
(fuel t0 level66)
(= (total-cost) 0)

(at p0 l3)
(at p1 l2)
(at p2 l3)
(at p3 l3)
)

(:goal
(and
(at p0 l0)
(at p1 l3)
(at p2 l2)
(at p3 l1)
)
)
(:metric minimize (total-cost)))

; plan
1. (drive t0 l0 l3 level45 level21 level66)
   deleted: (at t0 l0) (fuel t0 level66)
   added: (at t0 l3) (fuel t0 level45)
   goals met: 0 of 4
2. (load p3 t0 l3)
   deleted: (at p3 l3)
   added: (in p3 t0)
   goals met: 0 of 4
3. (load p2 t0 l3)
   deleted: (at p2 l3)
   added: (in p2 t0)
   goals met: 0 of 4
4. (load p0 t0 l3)
   deleted: (at p0 l3)
   added: (in p0 t0)
   goals met: 0 of 4
5. (drive t0 l3 l0 level24 level21 level45)
   deleted: (at t0 l3) (fuel t0 level45)
   added: (at t0 l0) (fuel t0 level24)
   goals met: 0 of 4
6. (unload p0 t0 l0)
   deleted: (in p0 t0)
   added: (at p0 l0)
   goals met: 1 of 4
7. (drive t0 l0 l2 level18 level6 level24)
   deleted: (at t0 l0) (fuel t0 level24)
   added: (at t0 l2) (fuel t0 level18)
   goals met: 1 of 4
8. (load p1 t0 l2)
   deleted: (at p1 l2)
   added: (in p1 t0)
   goals met: 1 of 4
9. (unload p2 t0 l2)
   deleted: (in p2 t0)
   added: (at p2 l2)
   goals met: 2 of 4
10. (drive t0 l2 l1 level8 level10 level18)
   deleted: (at t0 l2) (fuel t0 level18)
   added: (at t0 l1) (fuel t0 level8)
   goals met: 2 of 4
11. (unload p3 t0 l1)
   deleted: (in p3 t0)
   added: (at p3 l1)
   goals met: 3 of 4
12. (drive t0 l1 l3 level2 level6 level8)
   deleted: (at t0 l1) (fuel t0 level8)
   added: (at t0 l3) (fuel t0 level2)
   goals met: 3 of 4
13. (unload p1 t0 l3)
   deleted: (in p1 t0)
   added: (at p1 l3)
   goals met: 4 of 4
